# إنشاء قاموس يحتوي على أسماء الطلاب وأعمارهم
student_info = {
    "مجد": 17,
    "كريم": 17,
    "أحمد": 16,
    "سمية": 12,
    "رقية": 7
}

# 
print("مرحبًا بكم! اليوم سنعرض قائمة بأسماء الطلاب وأعمارهم.\n")
#
print("معلومات الطلاب:")
for name, age in student_info.items():
    print(f"الطالب: {name}, العمر: {age} سنة")

# 
print("\nلإضافة طالب جديد، لنستخدم الكود التالي:")
student_info["ليلى"] = 14
print(f"تمت إضافة الطالبة: ليلى بعمر {student_info['ليلى']} سنة.\n")

# 
print("معلومات الطلاب بعد الإضافة:")
for name, age in student_info.items():
    print(f"الطالب: {name}, العمر: {age} سنة")
